GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18lf25k83.inc
        LIST

;==========================================================================
; Build date : Oct 24 2019
;  MPASM PIC18LF25K83 processor include
; 
;  (c) Copyright 1999-2019 Microchip Technology, All rights reserved
;==========================================================================

        NOLIST

;==========================================================================
;  This header file defines configurations, registers, and other useful
;  bits of information for the PIC18LF25K83 microcontroller.  These names
;  are taken to match the data sheets as closely as possible.
;
;  Note that the processor must be selected before this file is included.
;  The processor may be selected the following ways:
;
;       1. Command line switch:
;               C:\MPASM MYFILE.ASM /PIC18LF25K83
;       2. LIST directive in the source file
;               LIST   P=PIC18LF25K83
;       3. Processor Type entry in the MPASM full-screen interface
;       4. Setting the processor in the MPLAB Project Dialog
;==========================================================================

;==========================================================================
;
;       Verify Processor
;
;==========================================================================
        IFNDEF __18LF25K83
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF

;==========================================================================
;       18xxxx Family        EQUates
;==========================================================================
FSR0             EQU  0
FSR1             EQU  1
FSR2             EQU  2

FAST             EQU  1

W                EQU  0
A                EQU  0
ACCESS           EQU  0
BANKED           EQU  1
;==========================================================================

;==========================================================================
;       16Cxxx/17Cxxx Substitutions
;==========================================================================
  #define DDRA  TRISA      ; PIC17Cxxx SFR substitution
  #define DDRB  TRISB      ; PIC17Cxxx SFR substitution
  #define DDRC  TRISC      ; PIC17Cxxx SFR substitution
  #define DDRD  TRISD      ; PIC17Cxxx SFR substitution
  #define DDRE  TRISE      ; PIC17Cxxx SFR substitution

;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------
CIOCON           EQU  H'3700'
RXERRCNT         EQU  H'3701'
TXERRCNT         EQU  H'3702'
BRGCON1          EQU  H'3703'
BRGCON2          EQU  H'3704'
BRGCON3          EQU  H'3705'
RXFCON0          EQU  H'3706'
RXFCON1          EQU  H'3707'
RXF6SIDH         EQU  H'3708'
RXF6SIDL         EQU  H'3709'
RXF6EIDH         EQU  H'370A'
RXF6EIDL         EQU  H'370B'
RXF7SIDH         EQU  H'370C'
RXF7SIDL         EQU  H'370D'
RXF7EIDH         EQU  H'370E'
RXF7EIDL         EQU  H'370F'
RXF8SIDH         EQU  H'3710'
RXF8SIDL         EQU  H'3711'
RXF8EIDH         EQU  H'3712'
RXF8EIDL         EQU  H'3713'
RXF9SIDH         EQU  H'3714'
RXF9SIDL         EQU  H'3715'
RXF9EIDH         EQU  H'3716'
RXF9EIDL         EQU  H'3717'
RXF10SIDH        EQU  H'3718'
RXF10SIDL        EQU  H'3719'
RXF10EIDH        EQU  H'371A'
RXF10EIDL        EQU  H'371B'
RXF11SIDH        EQU  H'371C'
RXF11SIDL        EQU  H'371D'
RXF11EIDH        EQU  H'371E'
RXF11EIDL        EQU  H'371F'
RXF12SIDH        EQU  H'3720'
RXF12SIDL        EQU  H'3721'
RXF12EIDH        EQU  H'3722'
RXF12EIDL        EQU  H'3723'
RXF13SIDH        EQU  H'3724'
RXF13SIDL        EQU  H'3725'
RXF13EIDH        EQU  H'3726'
RXF13EIDL        EQU  H'3727'
RXF14SIDH        EQU  H'3728'
RXF14SIDL        EQU  H'3729'
RXF14EIDH        EQU  H'372A'
RXF14EIDL        EQU  H'372B'
RXF15SIDH        EQU  H'372C'
RXF15SIDL        EQU  H'372D'
RXF15EIDH        EQU  H'372E'
RXF15EIDL        EQU  H'372F'
SDFLC            EQU  H'3730'
RXFBCON0         EQU  H'3731'
RXFBCON1         EQU  H'3732'
RXFBCON2         EQU  H'3733'
RXFBCON3         EQU  H'3734'
RXFBCON4         EQU  H'3735'
RXFBCON5         EQU  H'3736'
RXFBCON6         EQU  H'3737'
RXFBCON7         EQU  H'3738'
MSEL0            EQU  H'3739'
MSEL1            EQU  H'373A'
MSEL2            EQU  H'373B'
MSEL3            EQU  H'373C'
BSEL0            EQU  H'373D'
BIE0             EQU  H'373E'
TXBIE            EQU  H'373F'
B0CON            EQU  H'3740'
B0SIDH           EQU  H'3741'
B0SIDL           EQU  H'3742'
B0EIDH           EQU  H'3743'
B0EIDL           EQU  H'3744'
B0DLC            EQU  H'3745'
B0D0             EQU  H'3746'
B0D1             EQU  H'3747'
B0D2             EQU  H'3748'
B0D3             EQU  H'3749'
B0D4             EQU  H'374A'
B0D5             EQU  H'374B'
B0D6             EQU  H'374C'
B0D7             EQU  H'374D'
CANSTAT_RO9      EQU  H'374E'
CANCON_RO9       EQU  H'374F'
B1CON            EQU  H'3750'
B1SIDH           EQU  H'3751'
B1SIDL           EQU  H'3752'
B1EIDH           EQU  H'3753'
B1EIDL           EQU  H'3754'
B1DLC            EQU  H'3755'
B1D0             EQU  H'3756'
B1D1             EQU  H'3757'
B1D2             EQU  H'3758'
B1D3             EQU  H'3759'
B1D4             EQU  H'375A'
B1D5             EQU  H'375B'
B1D6             EQU  H'375C'
B1D7             EQU  H'375D'
CANSTAT_RO8      EQU  H'375E'
CANCON_RO8       EQU  H'375F'
B2CON            EQU  H'3760'
B2SIDH           EQU  H'3761'
B2SIDL           EQU  H'3762'
B2EIDH           EQU  H'3763'
B2EIDL           EQU  H'3764'
B2DLC            EQU  H'3765'
B2D0             EQU  H'3766'
B2D1             EQU  H'3767'
B2D2             EQU  H'3768'
B2D3             EQU  H'3769'
B2D4             EQU  H'376A'
B2D5             EQU  H'376B'
B2D6             EQU  H'376C'
B2D7             EQU  H'376D'
CANSTAT_RO7      EQU  H'376E'
CANCON_RO7       EQU  H'376F'
B3CON            EQU  H'3770'
B3SIDH           EQU  H'3771'
B3SIDL           EQU  H'3772'
B3EIDH           EQU  H'3773'
B3EIDL           EQU  H'3774'
B3DLC            EQU  H'3775'
B3D0             EQU  H'3776'
B3D1             EQU  H'3777'
B3D2             EQU  H'3778'
B3D3             EQU  H'3779'
B3D4             EQU  H'377A'
B3D5             EQU  H'377B'
B3D6             EQU  H'377C'
B3D7             EQU  H'377D'
CANSTAT_RO6      EQU  H'377E'
CANCON_RO6       EQU  H'377F'
B4CON            EQU  H'3780'
B4SIDH           EQU  H'3781'
B4SIDL           EQU  H'3782'
B4EIDH           EQU  H'3783'
B4EIDL           EQU  H'3784'
B4DLC            EQU  H'3785'
B4D0             EQU  H'3786'
B4D1             EQU  H'3787'
B4D2             EQU  H'3788'
B4D3             EQU  H'3789'
B4D4             EQU  H'378A'
B4D5             EQU  H'378B'
B4D6             EQU  H'378C'
B4D7             EQU  H'378D'
CANSTAT_RO5      EQU  H'378E'
CANCON_RO5       EQU  H'378F'
B5CON            EQU  H'3790'
B5SIDH           EQU  H'3791'
B5SIDL           EQU  H'3792'
B5EIDH           EQU  H'3793'
B5EIDL           EQU  H'3794'
B5DLC            EQU  H'3795'
B5D0             EQU  H'3796'
B5D1             EQU  H'3797'
B5D2             EQU  H'3798'
B5D3             EQU  H'3799'
B5D4             EQU  H'379A'
B5D5             EQU  H'379B'
B5D6             EQU  H'379C'
B5D7             EQU  H'379D'
CANSTAT_RO4      EQU  H'379E'
CANCON_RO4       EQU  H'379F'
RXF0SIDH         EQU  H'37A0'
RXF0SIDL         EQU  H'37A1'
RXF0EIDH         EQU  H'37A2'
RXF0EIDL         EQU  H'37A3'
RXF1SIDH         EQU  H'37A4'
RXF1SIDL         EQU  H'37A5'
RXF1EIDH         EQU  H'37A6'
RXF1EIDL         EQU  H'37A7'
RXF2SIDH         EQU  H'37A8'
RXF2SIDL         EQU  H'37A9'
RXF2EIDH         EQU  H'37AA'
RXF2EIDL         EQU  H'37AB'
RXF3SIDH         EQU  H'37AC'
RXF3SIDL         EQU  H'37AD'
RXF3EIDH         EQU  H'37AE'
RXF3EIDL         EQU  H'37AF'
RXF4SIDH         EQU  H'37B0'
RXF4SIDL         EQU  H'37B1'
RXF4EIDH         EQU  H'37B2'
RXF4EIDL         EQU  H'37B3'
RXF5SIDH         EQU  H'37B4'
RXF5SIDL         EQU  H'37B5'
RXF5EIDH         EQU  H'37B6'
RXF5EIDL         EQU  H'37B7'
RXM0SIDH         EQU  H'37B8'
RXM0SIDL         EQU  H'37B9'
RXM0EIDH         EQU  H'37BA'
RXM0EIDL         EQU  H'37BB'
RXM1SIDH         EQU  H'37BC'
RXM1SIDL         EQU  H'37BD'
RXM1EIDH         EQU  H'37BE'
RXM1EIDL         EQU  H'37BF'
TXB2CON          EQU  H'37C0'
TXB2SIDH         EQU  H'37C1'
TXB2SIDL         EQU  H'37C2'
TXB2EIDH         EQU  H'37C3'
TXB2EIDL         EQU  H'37C4'
TXB2DLC          EQU  H'37C5'
TXB2D0           EQU  H'37C6'
TXB2D1           EQU  H'37C7'
TXB2D2           EQU  H'37C8'
TXB2D3           EQU  H'37C9'
TXB2D4           EQU  H'37CA'
TXB2D5           EQU  H'37CB'
TXB2D6           EQU  H'37CC'
TXB2D7           EQU  H'37CD'
CANSTAT_R03      EQU  H'37CE'
CANCON_R03       EQU  H'37CF'
TXB1CON          EQU  H'37D0'
TXB1SIDH         EQU  H'37D1'
TXB1SIDL         EQU  H'37D2'
TXB1EIDH         EQU  H'37D3'
TXB1EIDL         EQU  H'37D4'
TXB1DLC          EQU  H'37D5'
TXB1D0           EQU  H'37D6'
TXB1D1           EQU  H'37D7'
TXB1D2           EQU  H'37D8'
TXB1D3           EQU  H'37D9'
TXB1D4           EQU  H'37DA'
TXB1D5           EQU  H'37DB'
TXB1D6           EQU  H'37DC'
TXB1D7           EQU  H'37DD'
CANSTAT_RO2      EQU  H'37DE'
CANCON_RO2       EQU  H'37DF'
TXB0CON          EQU  H'37E0'
TXB0SIDH         EQU  H'37E1'
TXB0SIDL         EQU  H'37E2'
TXB0EIDH         EQU  H'37E3'
TXB0EIDL         EQU  H'37E4'
TXB0DLC          EQU  H'37E5'
TXB0D0           EQU  H'37E6'
TXB0D1           EQU  H'37E7'
TXB0D2           EQU  H'37E8'
TXB0D3           EQU  H'37E9'
TXB0D4           EQU  H'37EA'
TXB0D5           EQU  H'37EB'
TXB0D6           EQU  H'37EC'
TXB0D7           EQU  H'37ED'
CANSTAT_RO1      EQU  H'37EE'
CANCON_RO1       EQU  H'37EF'
RXB1CON          EQU  H'37F0'
RXB1SIDH         EQU  H'37F1'
RXB1SIDL         EQU  H'37F2'
RXB1EIDH         EQU  H'37F3'
RXB1EIDL         EQU  H'37F4'
RXB1DLC          EQU  H'37F5'
RXB1D0           EQU  H'37F6'
RXB1D1           EQU  H'37F7'
RXB1D2           EQU  H'37F8'
RXB1D3           EQU  H'37F9'
RXB1D4           EQU  H'37FA'
RXB1D5           EQU  H'37FB'
RXB1D6           EQU  H'37FC'
RXB1D7           EQU  H'37FD'
CANSTAT_RO0      EQU  H'37FE'
CANCON_RO0       EQU  H'37FF'
STATUS_CSHAD     EQU  H'3880'
WREG_CSHAD       EQU  H'3881'
BSR_CSHAD        EQU  H'3882'
SHADCON          EQU  H'3883'
STATUS_SHAD      EQU  H'3884'
WREG_SHAD        EQU  H'3885'
BSR_SHAD         EQU  H'3886'
PCLATH_SHAD      EQU  H'3887'
PCLATU_SHAD      EQU  H'3888'
FSR0L_SHAD       EQU  H'3889'
FSR0SH           EQU  H'3889'
FSR0H_SHAD       EQU  H'388A'
FSR1L_SHAD       EQU  H'388B'
FSR1SH           EQU  H'388B'
FSR1H_SHAD       EQU  H'388C'
FSR2L_SHAD       EQU  H'388D'
FSR2SH           EQU  H'388D'
FSR2H_SHAD       EQU  H'388E'
PRODL_SHAD       EQU  H'388F'
PRODSH           EQU  H'388F'
PRODH_SHAD       EQU  H'3890'
IVTADL           EQU  H'389D'
IVTADH           EQU  H'389E'
IVTADU           EQU  H'389F'
WDTCON0          EQU  H'395B'
WDTCON1          EQU  H'395C'
WDTPSL           EQU  H'395D'
WDTPSH           EQU  H'395E'
WDTTMR           EQU  H'395F'
CRCDATA          EQU  H'3960'
CRCDATL          EQU  H'3960'
CRCDATH          EQU  H'3961'
CRCACC           EQU  H'3962'
CRCACCL          EQU  H'3962'
CRCACCH          EQU  H'3963'
CRCSHFT          EQU  H'3964'
CRCSHIFTL        EQU  H'3964'
CRCSHIFTH        EQU  H'3965'
CRCXOR           EQU  H'3966'
CRCXORL          EQU  H'3966'
CRCXORH          EQU  H'3967'
CRCCON0          EQU  H'3968'
CRCCON1          EQU  H'3969'
SCANLADR         EQU  H'3976'
SCANLADRL        EQU  H'3976'
SCANLADRH        EQU  H'3977'
SCANLADRU        EQU  H'3978'
SCANHADR         EQU  H'3979'
SCANHADRL        EQU  H'3979'
SCANHADRH        EQU  H'397A'
SCANHADRU        EQU  H'397B'
SCANCON0         EQU  H'397C'
SCANTRIG         EQU  H'397D'
IPR0             EQU  H'3980'
IPR1             EQU  H'3981'
IPR2             EQU  H'3982'
IPR3             EQU  H'3983'
IPR4             EQU  H'3984'
IPR5             EQU  H'3985'
IPR6             EQU  H'3986'
IPR7             EQU  H'3987'
IPR8             EQU  H'3988'
IPR9             EQU  H'3989'
PIE0             EQU  H'3990'
PIE1             EQU  H'3991'
PIE2             EQU  H'3992'
PIE3             EQU  H'3993'
PIE4             EQU  H'3994'
PIE5             EQU  H'3995'
PIE6             EQU  H'3996'
PIE7             EQU  H'3997'
PIE8             EQU  H'3998'
PIE9             EQU  H'3999'
PIR0             EQU  H'39A0'
PIR1             EQU  H'39A1'
PIR2             EQU  H'39A2'
PIR3             EQU  H'39A3'
PIR4             EQU  H'39A4'
PIR5             EQU  H'39A5'
PIR6             EQU  H'39A6'
PIR7             EQU  H'39A7'
PIR8             EQU  H'39A8'
PIR9             EQU  H'39A9'
PMD0             EQU  H'39C0'
PMD1             EQU  H'39C1'
PMD2             EQU  H'39C2'
PMD3             EQU  H'39C3'
PMD4             EQU  H'39C4'
PMD5             EQU  H'39C5'
PMD6             EQU  H'39C6'
PMD7             EQU  H'39C7'
BORCON           EQU  H'39D0'
CPUDOZE          EQU  H'39D8'
OSCCON1          EQU  H'39D9'
OSCCON2          EQU  H'39DA'
OSCCON3          EQU  H'39DB'
OSCSTAT          EQU  H'39DC'
OSCSTAT1         EQU  H'39DC'
OSCEN            EQU  H'39DD'
OSCTUNE          EQU  H'39DE'
OSCFRQ           EQU  H'39DF'
NVMADRL          EQU  H'39E0'
NVMADRH          EQU  H'39E1'
NVMDAT           EQU  H'39E3'
NVMCON1          EQU  H'39E5'
NVMCON2          EQU  H'39E6'
PRLOCK           EQU  H'39EF'
ISRPR            EQU  H'39F1'
MAINPR           EQU  H'39F2'
DMA1PR           EQU  H'39F3'
DMA2PR           EQU  H'39F4'
SCANPR           EQU  H'39F7'
RA0PPS           EQU  H'3A00'
RA1PPS           EQU  H'3A01'
RA2PPS           EQU  H'3A02'
RA3PPS           EQU  H'3A03'
RA4PPS           EQU  H'3A04'
RA5PPS           EQU  H'3A05'
RA6PPS           EQU  H'3A06'
RA7PPS           EQU  H'3A07'
RB0PPS           EQU  H'3A08'
RB1PPS           EQU  H'3A09'
RB2PPS           EQU  H'3A0A'
RB3PPS           EQU  H'3A0B'
RB4PPS           EQU  H'3A0C'
RB5PPS           EQU  H'3A0D'
RB6PPS           EQU  H'3A0E'
RB7PPS           EQU  H'3A0F'
RC0PPS           EQU  H'3A10'
RC1PPS           EQU  H'3A11'
RC2PPS           EQU  H'3A12'
RC3PPS           EQU  H'3A13'
RC4PPS           EQU  H'3A14'
RC5PPS           EQU  H'3A15'
RC6PPS           EQU  H'3A16'
RC7PPS           EQU  H'3A17'
ANSELA           EQU  H'3A40'
WPUA             EQU  H'3A41'
ODCONA           EQU  H'3A42'
SLRCONA          EQU  H'3A43'
INLVLA           EQU  H'3A44'
IOCAP            EQU  H'3A45'
IOCAN            EQU  H'3A46'
IOCAF            EQU  H'3A47'
ANSELB           EQU  H'3A50'
WPUB             EQU  H'3A51'
ODCONB           EQU  H'3A52'
SLRCONB          EQU  H'3A53'
INLVLB           EQU  H'3A54'
IOCBP            EQU  H'3A55'
IOCBN            EQU  H'3A56'
IOCBF            EQU  H'3A57'
RB1I2C           EQU  H'3A5A'
RB2I2C           EQU  H'3A5B'
ANSELC           EQU  H'3A60'
WPUC             EQU  H'3A61'
ODCONC           EQU  H'3A62'
SLRCONC          EQU  H'3A63'
INLVLC           EQU  H'3A64'
IOCCP            EQU  H'3A65'
IOCCN            EQU  H'3A66'
IOCCF            EQU  H'3A67'
RC3I2C           EQU  H'3A6A'
RC4I2C           EQU  H'3A6B'
WPUE             EQU  H'3A81'
INLVLE           EQU  H'3A84'
IOCEP            EQU  H'3A85'
IOCEN            EQU  H'3A86'
IOCEF            EQU  H'3A87'
PPSLOCK          EQU  H'3ABF'
INT0PPS          EQU  H'3AC0'
INT1PPS          EQU  H'3AC1'
INT2PPS          EQU  H'3AC2'
T0CKIPPS         EQU  H'3AC3'
T1CKIPPS         EQU  H'3AC4'
T1GPPS           EQU  H'3AC5'
T3CKIPPS         EQU  H'3AC6'
T3GPPS           EQU  H'3AC7'
T5CKIPPS         EQU  H'3AC8'
T5GPPS           EQU  H'3AC9'
T2INPPS          EQU  H'3ACA'
T4INPPS          EQU  H'3ACB'
T6INPPS          EQU  H'3ACC'
CCP1PPS          EQU  H'3ACD'
CCP2PPS          EQU  H'3ACE'
CCP3PPS          EQU  H'3ACF'
CCP4PPS          EQU  H'3AD0'
SMT1WINPPS       EQU  H'3AD1'
SMT1SIGPPS       EQU  H'3AD2'
SMT2WINPPS       EQU  H'3AD3'
SMT2SIGPPS       EQU  H'3AD4'
CWG1INPPS        EQU  H'3AD5'
CWG2INPPS        EQU  H'3AD6'
CWG3INPPS        EQU  H'3AD7'
MD1CARLPPS       EQU  H'3AD8'
MD1CARHPPS       EQU  H'3AD9'
MD1SRCPPS        EQU  H'3ADA'
CLCIN0PPS        EQU  H'3ADB'
CLCIN1PPS        EQU  H'3ADC'
CLCIN2PPS        EQU  H'3ADD'
CLCIN3PPS        EQU  H'3ADE'
ADACTPPS         EQU  H'3ADF'
SPI1SCKPPS       EQU  H'3AE0'
SPI1SDIPPS       EQU  H'3AE1'
SPI1SSPPS        EQU  H'3AE2'
I2C1SCLPPS       EQU  H'3AE3'
I2C1SDAPPS       EQU  H'3AE4'
I2C2SCLPPS       EQU  H'3AE5'
I2C2SDAPPS       EQU  H'3AE6'
U1RXPPS          EQU  H'3AE7'
U1CTSPPS         EQU  H'3AE8'
U2RXPPS          EQU  H'3AEA'
U2CTSPPS         EQU  H'3AEB'
CANRXPPS         EQU  H'3AED'
DMA2BUF          EQU  H'3BC9'
DMA2DCNT         EQU  H'3BCA'
DMA2DCNTL        EQU  H'3BCA'
DMA2DCNTH        EQU  H'3BCB'
DMA2DPTR         EQU  H'3BCC'
DMA2DPTRL        EQU  H'3BCC'
DMA2DPTRH        EQU  H'3BCD'
DMA2DSZ          EQU  H'3BCE'
DMA2DSZL         EQU  H'3BCE'
DMA2DSZH         EQU  H'3BCF'
DMA2DSA          EQU  H'3BD0'
DMA2DSAL         EQU  H'3BD0'
DMA2DSAH         EQU  H'3BD1'
DMA2SCNT         EQU  H'3BD2'
DMA2SCNTL        EQU  H'3BD2'
DMA2SCNTH        EQU  H'3BD3'
DMA2SPTR         EQU  H'3BD4'
DMA2SPTRL        EQU  H'3BD4'
DMA2SPTRH        EQU  H'3BD5'
DMA2SPTRU        EQU  H'3BD6'
DMA2SSZ          EQU  H'3BD7'
DMA2SSZL         EQU  H'3BD7'
DMA2SSZH         EQU  H'3BD8'
DMA2SSA          EQU  H'3BD9'
DMA2SSAL         EQU  H'3BD9'
DMA2SSAH         EQU  H'3BDA'
DMA2SSAU         EQU  H'3BDB'
DMA2CON0         EQU  H'3BDC'
DMA2CON1         EQU  H'3BDD'
DMA2AIRQ         EQU  H'3BDE'
DMA2SIRQ         EQU  H'3BDF'
DMA1BUF          EQU  H'3BE9'
DMA1DCNT         EQU  H'3BEA'
DMA1DCNTL        EQU  H'3BEA'
DMA1DCNTH        EQU  H'3BEB'
DMA1DPTR         EQU  H'3BEC'
DMA1DPTRL        EQU  H'3BEC'
DMA1DPTRH        EQU  H'3BED'
DMA1DSZ          EQU  H'3BEE'
DMA1DSZL         EQU  H'3BEE'
DMA1DSZH         EQU  H'3BEF'
DMA1DSA          EQU  H'3BF0'
DMA1DSAL         EQU  H'3BF0'
DMA1DSAH         EQU  H'3BF1'
DMA1SCNT         EQU  H'3BF2'
DMA1SCNTL        EQU  H'3BF2'
DMA1SCNTH        EQU  H'3BF3'
DMA1SPTR         EQU  H'3BF4'
DMA1SPTRL        EQU  H'3BF4'
DMA1SPTRH        EQU  H'3BF5'
DMA1SPTRU        EQU  H'3BF6'
DMA1SSZ          EQU  H'3BF7'
DMA1SSZL         EQU  H'3BF7'
DMA1SSZH         EQU  H'3BF8'
DMA1SSA          EQU  H'3BF9'
DMA1SSAL         EQU  H'3BF9'
DMA1SSAH         EQU  H'3BFA'
DMA1SSAU         EQU  H'3BFB'
DMA1CON0         EQU  H'3BFC'
DMA1CON1         EQU  H'3BFD'
DMA1AIRQ         EQU  H'3BFE'
DMA1SIRQ         EQU  H'3BFF'
CLC4CON          EQU  H'3C56'
CLC4POL          EQU  H'3C57'
CLC4SEL0         EQU  H'3C58'
CLC4SEL1         EQU  H'3C59'
CLC4SEL2         EQU  H'3C5A'
CLC4SEL3         EQU  H'3C5B'
CLC4GLS0         EQU  H'3C5C'
CLC4GLS1         EQU  H'3C5D'
CLC4GLS2         EQU  H'3C5E'
CLC4GLS3         EQU  H'3C5F'
CLC3CON          EQU  H'3C60'
CLC3POL          EQU  H'3C61'
CLC3SEL0         EQU  H'3C62'
CLC3SEL1         EQU  H'3C63'
CLC3SEL2         EQU  H'3C64'
CLC3SEL3         EQU  H'3C65'
CLC3GLS0         EQU  H'3C66'
CLC3GLS1         EQU  H'3C67'
CLC3GLS2         EQU  H'3C68'
CLC3GLS3         EQU  H'3C69'
CLC2CON          EQU  H'3C6A'
CLC2POL          EQU  H'3C6B'
CLC2SEL0         EQU  H'3C6C'
CLC2SEL1         EQU  H'3C6D'
CLC2SEL2         EQU  H'3C6E'
CLC2SEL3         EQU  H'3C6F'
CLC2GLS0         EQU  H'3C70'
CLC2GLS1         EQU  H'3C71'
CLC2GLS2         EQU  H'3C72'
CLC2GLS3         EQU  H'3C73'
CLC1CON          EQU  H'3C74'
CLC1POL          EQU  H'3C75'
CLC1SEL0         EQU  H'3C76'
CLC1SEL1         EQU  H'3C77'
CLC1SEL2         EQU  H'3C78'
CLC1SEL3         EQU  H'3C79'
CLC1GLS0         EQU  H'3C7A'
CLC1GLS1         EQU  H'3C7B'
CLC1GLS2         EQU  H'3C7C'
CLC1GLS3         EQU  H'3C7D'
CLCDATA0         EQU  H'3C7E'
CLKRCON          EQU  H'3CE5'
CLKRCLK          EQU  H'3CE6'
MD1CON0          EQU  H'3CFA'
MD1CON1          EQU  H'3CFB'
MD1SRC           EQU  H'3CFC'
MD1CARL          EQU  H'3CFD'
MD1CARH          EQU  H'3CFE'
SPI1RXB          EQU  H'3D10'
SPI1TXB          EQU  H'3D11'
SPI1TCNT         EQU  H'3D12'
SPI1TCNTL        EQU  H'3D12'
SPI1TCNTH        EQU  H'3D13'
SPI1CON0         EQU  H'3D14'
SPI1CON1         EQU  H'3D15'
SPI1CON2         EQU  H'3D16'
SPI1STATUS       EQU  H'3D17'
SPI1TWIDTH       EQU  H'3D18'
SPI1BAUD         EQU  H'3D19'
SPI1INTF         EQU  H'3D1A'
SPI1INTE         EQU  H'3D1B'
SPI1CLK          EQU  H'3D1C'
I2C2RXB          EQU  H'3D54'
I2C2TXB          EQU  H'3D55'
I2C2CNT          EQU  H'3D56'
I2C2ADB0         EQU  H'3D57'
I2C2ADB1         EQU  H'3D58'
I2C2ADR0         EQU  H'3D59'
I2C2ADR1         EQU  H'3D5A'
I2C2ADR2         EQU  H'3D5B'
I2C2ADR3         EQU  H'3D5C'
I2C2CON0         EQU  H'3D5D'
I2C2CON1         EQU  H'3D5E'
I2C2CON2         EQU  H'3D5F'
I2C2ERR          EQU  H'3D60'
I2C2STAT0        EQU  H'3D61'
I2C2STAT1        EQU  H'3D62'
I2C2PIR          EQU  H'3D63'
I2C2PIE          EQU  H'3D64'
I2C2CLK          EQU  H'3D65'
I2C2BTO          EQU  H'3D66'
I2C1RXB          EQU  H'3D6A'
I2C1TXB          EQU  H'3D6B'
I2C1CNT          EQU  H'3D6C'
I2C1ADB0         EQU  H'3D6D'
I2C1ADB1         EQU  H'3D6E'
I2C1ADR0         EQU  H'3D6F'
I2C1ADR1         EQU  H'3D70'
I2C1ADR2         EQU  H'3D71'
I2C1ADR3         EQU  H'3D72'
I2C1CON0         EQU  H'3D73'
I2C1CON1         EQU  H'3D74'
I2C1CON2         EQU  H'3D75'
I2C1ERR          EQU  H'3D76'
I2C1STAT0        EQU  H'3D77'
I2C1STAT1        EQU  H'3D78'
I2C1PIR          EQU  H'3D79'
I2C1PIE          EQU  H'3D7A'
I2C1CLK          EQU  H'3D7B'
I2C1BTO          EQU  H'3D7C'
U2RXB            EQU  H'3DD0'
U2RXBL           EQU  H'3DD0'
U2RXCHK          EQU  H'3DD1'
U2TXB            EQU  H'3DD2'
U2TXBL           EQU  H'3DD2'
U2TXCHK          EQU  H'3DD3'
U2P1             EQU  H'3DD4'
U2P1L            EQU  H'3DD4'
U2P1H            EQU  H'3DD5'
U2P2             EQU  H'3DD6'
U2P2L            EQU  H'3DD6'
U2P2H            EQU  H'3DD7'
U2P3             EQU  H'3DD8'
U2P3L            EQU  H'3DD8'
U2P3H            EQU  H'3DD9'
U2CON0           EQU  H'3DDA'
U2CON1           EQU  H'3DDB'
U2CON2           EQU  H'3DDC'
U2BRG            EQU  H'3DDD'
U2BRGL           EQU  H'3DDD'
U2BRGH           EQU  H'3DDE'
U2FIFO           EQU  H'3DDF'
U2UIR            EQU  H'3DE0'
U2ERRIR          EQU  H'3DE1'
U2ERRIE          EQU  H'3DE2'
U1RXB            EQU  H'3DE8'
U1RXBL           EQU  H'3DE8'
U1RXCHK          EQU  H'3DE9'
U1TXB            EQU  H'3DEA'
U1TXBL           EQU  H'3DEA'
U1TXCHK          EQU  H'3DEB'
U1P1             EQU  H'3DEC'
U1P1L            EQU  H'3DEC'
U1P1H            EQU  H'3DED'
U1P2             EQU  H'3DEE'
U1P2L            EQU  H'3DEE'
U1P2H            EQU  H'3DEF'
U1P3             EQU  H'3DF0'
U1P3L            EQU  H'3DF0'
U1P3H            EQU  H'3DF1'
U1CON0           EQU  H'3DF2'
U1CON1           EQU  H'3DF3'
U1CON2           EQU  H'3DF4'
U1BRG            EQU  H'3DF5'
U1BRGL           EQU  H'3DF5'
U1BRGH           EQU  H'3DF6'
U1FIFO           EQU  H'3DF7'
U1UIR            EQU  H'3DF8'
U1ERRIR          EQU  H'3DF9'
U1ERRIE          EQU  H'3DFA'
DAC1CON1         EQU  H'3E9C'
DAC1CON0         EQU  H'3E9E'
CM2CON0          EQU  H'3EB8'
CM2CON1          EQU  H'3EB9'
CM2NCH           EQU  H'3EBA'
CM2PCH           EQU  H'3EBB'
